<a href="https://colab.research.google.com/github/JotaBlanco/TheValley/blob/main/Arboles/Clase_01_Arboles/01_%C3%81rboles_Decisi%C3%B3n.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 01 INTRO: Árboles de Decisión
Explicación de cómo construír árboles de decisión.

Notebook por [Javier Blanco Cordero](https://www.linkedin.com/in/javier-blanco-cordero-71373656/).

### Enlaces de interés
*   [Slides de presentación](https://docs.google.com/presentation/d/16tnAAaiT6mrelG8zRg26crXAChWmzjOG2NyA0oyh4X0/edit?usp=sharing)
*   [Enlace a este notebook en Colab](https://colab.research.google.com/github/JotaBlanco/TheValley/blob/main/Notebooks/03-analisis-univariante-causal-multivariante/03_A___Analisis_univariante.ipynb)

## 0101 Qué es un árbol de decisión?
Un tipo de algoritmo de aprendizaje supervisado que se basa en realizar particiones a partir de distintos niveles de las variables disponibles.

## 0102 Import
Importamos todas las librerías necesarias para este análisis ([¿No sabes lo que es una librería de Python?](https://www.quora.com/What-is-a-Python-library-and-what-can-I-use-it-for)): pandas, numpy, seaborn, matplotlib.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## 0103 Carga el dataset de accidentes cardiacos
Para probar a hacer árboles de decisión utilizaremos un dataset sobre accidentes coronarios que he encontrado en Kaggle ([aquí](https://www.kaggle.com/andrewmvd/heart-failure-clinical-data)). 

Podéis encontrar el archivo listo para importar en mi github: 'https://raw.githubusercontent.com/JotaBlanco/TheValley/main/Data/heart_failure.csv'. 

Importa este dataset en un dataframe llamado **df**.

In [2]:
# Url archivo raw
url = 'https://raw.githubusercontent.com/JotaBlanco/TheValley/main/Data/heart_failure.csv'

# Importa csv
df = pd.read_csv(url)

# Visualización primeras filas
df.head()

    age  anaemia  creatinine_phosphokinase  ...  smoking  time  DEATH_EVENT
0  75.0        0                       582  ...        0     4            1
1  55.0        0                      7861  ...        0     6            1
2  65.0        0                       146  ...        1     7            1
3  50.0        1                       111  ...        0     7            1
4  65.0        1                       160  ...        0     8            1

[5 rows x 13 columns]

# 02 EDA
Realizaremos un pequeño análisis exploratorio visual para familiarizarnos con el dataset. 

Recuerda que puedes encontrar mis clases sobre análisis exploratorio [aquí](https://github.com/JotaBlanco/TheValley/tree/main/EDA/).

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       299 non-null    float64
 1   anaemia                   299 non-null    int64
 2   creatinine_phosphokinase  299 non-null    int64
 3   diabetes                  299 non-null    int64
 4   ejection_fraction         299 non-null    int64
 5   high_blood_pressure       299 non-null    int64
 6   platelets                 299 non-null    float64
 7   serum_creatinine          299 non-null    float64
 8   serum_sodium              299 non-null    int64
 9   sex                       299 non-null    int64
 10  smoking                   299 non-null    int64
 11  time                      299 non-null    int64
 12  DEATH_EVENT               299 non-null    int64
dtypes: float64(3), int64(10)
memory usage: 30.5 KB

# 03 Construcción árbol de decisión a mano
Nunca lo haremos en la vida real, pero para afianzar el entendimiento de este tipo de algoritmos, vamos a reproducir el proceso de entrenamiento a mano.

## 0301 DataFrame
Para simplificar, haremos esto con un dataframe consistente solo en las columnas ['age', 'anaemia', 'serum_creatinine', 'DEATH_EVENT'] renombradas como ['Edad', 'Anemia', 'Serum', 'Fallece'].

In [4]:
df_resumen = df[['age', 'anaemia', 'serum_creatinine', 'DEATH_EVENT']]
df_resumen.columns = ['Edad', 'Anemia', 'Serum', 'Fallece']
df_resumen.sample(10).reset_index(drop=True)

   Edad  Anemia  Serum  Fallece
0  61.0       1    0.9        0
1  55.0       0    0.8        0
2  52.0       1    1.0        0
3  56.0       1    1.7        0
4  50.0       1    0.9        1
5  55.0       0    1.3        0
6  65.0       0    1.3        1
7  45.0       0    1.6        1
8  45.0       0    1.0        0
9  60.0       1    0.7        0

## 0301 Seleccionamos el nodo raíz
Para seleccionar el nodo raíz generaremos árboles muy sencillos, de solo 3 nodos (una sola partición).

### 030101 Variable categórica
Probamos a generar un árbol de sólo dos particiones.

In [53]:
# Podemos hacer la partición Anemia = 1 y Anemia = 0 con un groupby
df_resumen.groupby('Anemia')['Fallece'].agg(['count', 'sum']).reset_index()

   Anemia  count  sum
0       0    170   50
1       1    129   46

In [54]:
# Guardamos el resultado y le damos nombres más explicativos a las columnas
df_i = df_resumen.groupby('Anemia')['Fallece'].agg(['count', 'sum']).reset_index()
df_i.columns = ['Anemia', 'Total', 'Fallece = 1']
df_i

   Anemia  Total  Fallece = 1
0       0    170           50
1       1    129           46

In [55]:
#Añadimos más información útil
df_i = df_resumen.groupby('Anemia')['Fallece'].agg(['count', 'sum']).reset_index()
df_i.columns = ['Anemia', 'Total', 'Fallece = 1']
df_i['Fallece = 0'] = df_i['Total'] - df_i['Fallece = 1']
df_i['Mean'] = np.round(df_i['Fallece = 1']/df_i['Total'], 4)
df_i

   Anemia  Total  Fallece = 1  Fallece = 0    Mean
0       0    170           50          120  0.2941
1       1    129           46           83  0.3566

#### EJERCICIO
Crea la función **particion_categorica** que, dado un dataframe con datos, una variable discreta binaria (como 'Anemia') y una variable target, devuelva un dataframe con información de la partición similar a la que acabamos de generar en la celda anterior.

In [56]:
def particion_categorica(df, target, var_discreta):
  """
  Genera un dataframe con información sobre la partición utilizando la variable
  discreta binaria aportada.
  """
  df_i = df.groupby(var_discreta)[target].agg(['count', 'sum']).reset_index()
  df_i.columns = [var_discreta, 'Total', target + ' = 1']
  df_i[target + ' = 0'] = df_i['Total'] - df_i[target + ' = 1']
  df_i['Mean'] = np.round(df_i[target + ' = 1']/df_i['Total'], 4)
  return df_i

In [57]:
df_i = particion_categorica(df_resumen, 'Fallece', 'Anemia')
df_i

   Anemia  Total  Fallece = 1  Fallece = 0    Mean
0       0    170           50          120  0.2941
1       1    129           46           83  0.3566

### 030102 Variable Continua
Las variables continuas pueden dar lugar a diversas particiones. Veamos la variable 'Edad' como ejemplo.

In [58]:
# Cuantos valores distintos de edad hay?
df_resumen['Edad'].nunique()

47

In [59]:
# Valores distintos de edad en orden 
valores_edad_unicos_ordenados = df_resumen['Edad'].sort_values().unique()
valores_edad_unicos_ordenados

array([40.   , 41.   , 42.   , 43.   , 44.   , 45.   , 46.   , 47.   ,
       48.   , 49.   , 50.   , 51.   , 52.   , 53.   , 54.   , 55.   ,
       56.   , 57.   , 58.   , 59.   , 60.   , 60.667, 61.   , 62.   ,
       63.   , 64.   , 65.   , 66.   , 67.   , 68.   , 69.   , 70.   ,
       72.   , 73.   , 75.   , 77.   , 78.   , 79.   , 80.   , 81.   ,
       82.   , 85.   , 86.   , 87.   , 90.   , 94.   , 95.   ])

In [60]:
# Por tanto hay 46 particiones posibles, en torno a los valores:
valores_particiones = (valores_edad_unicos_ordenados[:-1] + valores_edad_unicos_ordenados[1:])/2
valores_particiones

array([40.5   , 41.5   , 42.5   , 43.5   , 44.5   , 45.5   , 46.5   ,
       47.5   , 48.5   , 49.5   , 50.5   , 51.5   , 52.5   , 53.5   ,
       54.5   , 55.5   , 56.5   , 57.5   , 58.5   , 59.5   , 60.3335,
       60.8335, 61.5   , 62.5   , 63.5   , 64.5   , 65.5   , 66.5   ,
       67.5   , 68.5   , 69.5   , 71.    , 72.5   , 74.    , 76.    ,
       77.5   , 78.5   , 79.5   , 80.5   , 81.5   , 83.5   , 85.5   ,
       86.5   , 88.5   , 92.    , 94.5   ])

In [61]:
# Ahora, podemos hacer un árbol para cada valor de partición. 
# Por ejemplo, para la partición 63.5
df_resumen_i = df_resumen.copy(deep=True)

filtro_i = df_resumen_i['Edad'] > 63.5
df_resumen_i['Edad > 63.5'] = filtro_i.astype(int)

df_resumen_i.head()

   Edad  Anemia  Serum  Fallece  Edad > 94.5  Edad > 63.5
0  75.0       0    1.9        1            0            1
1  55.0       0    1.1        1            0            0
2  65.0       0    1.3        1            0            1
3  50.0       1    1.9        1            0            0
4  65.0       1    2.7        1            0            1

In [62]:
# Ahora podemos generar la partición categórica sobre la oclumna Edad > 63.5
particion_categorica(df_resumen_i, 'Fallece', 'Edad > 63.5')

   Edad > 63.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    181           46          135  0.2541
1            1    118           50           68  0.4237

In [63]:
# Hagamos un loop que devuelva todas las particiones posibles
for particion in valores_particiones:
  df_resumen_i = df_resumen.copy(deep=True)

  filtro_i = df_resumen_i['Edad'] > particion
  df_resumen_i['Edad > ' + str(particion)] = filtro_i.astype(int)

  df_i = particion_categorica(df_resumen_i, 'Fallece', 'Edad > ' + str(particion))
  display(df_i)

   Edad > 40.5  Total  Fallece = 1  Fallece = 0    Mean
0            0      7            0            7  0.0000
1            1    292           96          196  0.3288

   Edad > 41.5  Total  Fallece = 1  Fallece = 0    Mean
0            0      8            0            8  0.0000
1            1    291           96          195  0.3299

   Edad > 42.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     15            1           14  0.0667
1            1    284           95          189  0.3345

   Edad > 43.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     16            1           15  0.0625
1            1    283           95          188  0.3357

   Edad > 44.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     18            1           17  0.0556
1            1    281           95          186  0.3381

   Edad > 45.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     37            7           30  0.1892
1            1    262           89          173  0.3397

   Edad > 46.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     40            8           32  0.2000
1            1    259           88          171  0.3398

   Edad > 47.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     41            8           33  0.1951
1            1    258           88          170  0.3411

   Edad > 48.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     43           10           33  0.2326
1            1    256           86          170  0.3359

   Edad > 49.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     47           11           36  0.2340
1            1    252           85          167  0.3373

   Edad > 50.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     74           19           55  0.2568
1            1    225           77          148  0.3422

   Edad > 51.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     78           20           58  0.2564
1            1    221           76          145  0.3439

   Edad > 52.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     83           20           63  0.2410
1            1    216           76          140  0.3519

   Edad > 53.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     93           21           72  0.2258
1            1    206           75          131  0.3641

   Edad > 54.5  Total  Fallece = 1  Fallece = 0    Mean
0            0     95           22           73  0.2316
1            1    204           74          130  0.3627

   Edad > 55.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    112           25           87  0.2232
1            1    187           71          116  0.3797

   Edad > 56.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    113           25           88  0.2212
1            1    186           71          115  0.3817

   Edad > 57.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    115           26           89  0.2261
1            1    184           70          114  0.3804

   Edad > 58.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    125           28           97  0.2240
1            1    174           68          106  0.3908

   Edad > 59.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    129           31           98  0.2403
1            1    170           65          105  0.3824

   Edad > 60.3335  Total  Fallece = 1  Fallece = 0    Mean
0               0    162           44          118  0.2716
1               1    137           52           85  0.3796

   Edad > 60.8335  Total  Fallece = 1  Fallece = 0    Mean
0               0    164           45          119  0.2744
1               1    135           51           84  0.3778

   Edad > 61.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    168           45          123  0.2679
1            1    131           51           80  0.3893

   Edad > 62.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    173           46          127  0.2659
1            1    126           50           76  0.3968

   Edad > 63.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    181           46          135  0.2541
1            1    118           50           68  0.4237

   Edad > 64.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    184           46          138  0.2500
1            1    115           50           65  0.4348

   Edad > 65.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    210           54          156  0.2571
1            1     89           42           47  0.4719

   Edad > 66.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    212           54          158  0.2547
1            1     87           42           45  0.4828

   Edad > 67.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    214           54          160  0.2523
1            1     85           42           43  0.4941

   Edad > 68.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    219           56          163  0.2557
1            1     80           40           40  0.5000

   Edad > 69.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    222           58          164  0.2613
1            1     77           38           39  0.4935

   Edad > 71.0  Total  Fallece = 1  Fallece = 0    Mean
0            0    247           65          182  0.2632
1            1     52           31           21  0.5962

   Edad > 72.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    254           70          184  0.2756
1            1     45           26           19  0.5778

   Edad > 74.0  Total  Fallece = 1  Fallece = 0    Mean
0            0    258           71          187  0.2752
1            1     41           25           16  0.6098

   Edad > 76.0  Total  Fallece = 1  Fallece = 0    Mean
0            0    269           77          192  0.2862
1            1     30           19           11  0.6333

   Edad > 77.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    271           78          193  0.2878
1            1     28           18           10  0.6429

   Edad > 78.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    273           78          195  0.2857
1            1     26           18            8  0.6923

   Edad > 79.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    274           78          196  0.2847
1            1     25           18            7  0.7200

   Edad > 80.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    281           83          198  0.2954
1            1     18           13            5  0.7222

   Edad > 81.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    282           83          199  0.2943
1            1     17           13            4  0.7647

   Edad > 83.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    285           86          199  0.3018
1            1     14           10            4  0.7143

   Edad > 85.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    291           89          202  0.3058
1            1      8            7            1  0.8750

   Edad > 86.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    292           90          202  0.3082
1            1      7            6            1  0.8571

   Edad > 88.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    293           91          202  0.3106
1            1      6            5            1  0.8333

   Edad > 92.0  Total  Fallece = 1  Fallece = 0    Mean
0            0    296           93          203  0.3142
1            1      3            3            0  1.0000

   Edad > 94.5  Total  Fallece = 1  Fallece = 0    Mean
0            0    297           94          203  0.3165
1            1      2            2            0  1.0000

#### EJERCICIO 
Crea la función **particiones_continuas** que, dado un dataframe con datos, una variable continua (como 'Edad' o 'Serum') y una variable target, muestre una serie de dataframes con información para cada una de las particiones. (Devuelve un resultado similar a la que acabamos de generar en la celda anterior).

In [80]:
def particiones_continuas(df, target, var_continua):
  """
  Muestra una serie dataframes con información sobre las distintas particiones 
  posibles utilizando la variable continua aportada.
  """
  valores_edad_unicos_ordenados = df[var_continua].sort_values().unique()
  valores_particiones = (valores_edad_unicos_ordenados[:-1] + 
                         valores_edad_unicos_ordenados[1:])/2

  for valor in valores_particiones:
    df_i = df.copy(deep=True)
    filtro_i = df_i[var_continua] > valor
    df_i[str(var_continua) + ' > ' + str(valor)] = filtro_i.astype(int)
    df_i = particion_categorica(df_i, 
                                'Fallece', 
                                str(var_continua) + ' > ' + str(valor))
    display(df_i)

In [81]:
particiones_continuas(df_resumen, 'Fallece', 'Edad')

   Edad > 40.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0      7            0  ...  0.0000  0.000000            0.431
1            1    292           96  ...  0.3288  0.441381            0.431

[2 rows x 7 columns]

   Edad > 41.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0      8            0  ...  0.0000  0.000000           0.4303
1            1    291           96  ...  0.3299  0.442132           0.4303

[2 rows x 7 columns]

   Edad > 42.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     15            1  ...  0.0667  0.124502           0.4291
1            1    284           95  ...  0.3345  0.445220           0.4291

[2 rows x 7 columns]

   Edad > 43.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     16            1  ...  0.0625  0.117188           0.4284
1            1    283           95  ...  0.3357  0.446011           0.4284

[2 rows x 7 columns]

   Edad > 44.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     18            1  ...  0.0556  0.105017            0.427
1            1    281           95  ...  0.3381  0.447577            0.427

[2 rows x 7 columns]

   Edad > 45.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     37            7  ...  0.1892  0.306807           0.4311
1            1    262           89  ...  0.3397  0.448608           0.4311

[2 rows x 7 columns]

   Edad > 46.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     40            8  ...  0.2000  0.320000           0.4315
1            1    259           88  ...  0.3398  0.448672           0.4315

[2 rows x 7 columns]

   Edad > 47.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     41            8  ...  0.1951  0.314072           0.4309
1            1    258           88  ...  0.3411  0.449502           0.4309

[2 rows x 7 columns]

   Edad > 48.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     43           10  ...  0.2326  0.356994           0.4333
1            1    256           86  ...  0.3359  0.446142           0.4333

[2 rows x 7 columns]

   Edad > 49.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     47           11  ...  0.2340  0.358488           0.4331
1            1    252           85  ...  0.3373  0.447057           0.4331

[2 rows x 7 columns]

   Edad > 50.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     74           19  ...  0.2568  0.381708           0.4332
1            1    225           77  ...  0.3422  0.450198           0.4332

[2 rows x 7 columns]

   Edad > 51.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     78           20  ...  0.2564  0.381318            0.433
1            1    221           76  ...  0.3439  0.451266            0.433

[2 rows x 7 columns]

   Edad > 52.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     83           20  ...  0.2410  0.365838           0.4311
1            1    216           76  ...  0.3519  0.456133           0.4311

[2 rows x 7 columns]

   Edad > 53.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     93           21  ...  0.2258  0.349629           0.4278
1            1    206           75  ...  0.3641  0.463062           0.4278

[2 rows x 7 columns]

   Edad > 54.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     95           22  ...  0.2316  0.355923           0.4285
1            1    204           74  ...  0.3627  0.462297           0.4285

[2 rows x 7 columns]

   Edad > 55.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    112           25  ...  0.2232  0.346764           0.4245
1            1    187           71  ...  0.3797  0.471056           0.4245

[2 rows x 7 columns]

   Edad > 56.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    113           25  ...  0.2212  0.344541           0.4238
1            1    186           71  ...  0.3817  0.472010           0.4238

[2 rows x 7 columns]

   Edad > 57.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    115           26  ...  0.2261  0.349958           0.4247
1            1    184           70  ...  0.3804  0.471392           0.4247

[2 rows x 7 columns]

   Edad > 58.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    125           28  ...  0.2240  0.347648           0.4224
1            1    174           68  ...  0.3908  0.476151           0.4224

[2 rows x 7 columns]

   Edad > 59.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    129           31  ...  0.2403  0.365112           0.4261
1            1    170           65  ...  0.3824  0.472340           0.4261

[2 rows x 7 columns]

   Edad > 60.3335  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0               0    162           44  ...  0.2716  0.395667           0.4302
1               1    137           52  ...  0.3796  0.471008           0.4302

[2 rows x 7 columns]

   Edad > 60.8335  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0               0    164           45  ...  0.2744  0.398209           0.4307
1               1    135           51  ...  0.3778  0.470134           0.4307

[2 rows x 7 columns]

   Edad > 61.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    168           45  ...  0.2679  0.392259           0.4287
1            1    131           51  ...  0.3893  0.475491           0.4287

[2 rows x 7 columns]

   Edad > 62.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    173           46  ...  0.2659  0.390394           0.4276
1            1    126           50  ...  0.3968  0.478700           0.4276

[2 rows x 7 columns]

   Edad > 63.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    181           46  ...  0.2541  0.379066           0.4222
1            1    118           50  ...  0.4237  0.488357           0.4222

[2 rows x 7 columns]

   Edad > 64.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    184           46  ...  0.2500  0.375000           0.4198
1            1    115           50  ...  0.4348  0.491498           0.4198

[2 rows x 7 columns]

   Edad > 65.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    210           54  ...  0.2571  0.381999           0.4167
1            1     89           42  ...  0.4719  0.498421           0.4167

[2 rows x 7 columns]

   Edad > 66.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    212           54  ...  0.2547  0.379656           0.4145
1            1     87           42  ...  0.4828  0.499408           0.4145

[2 rows x 7 columns]

   Edad > 67.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    214           54  ...  0.2523  0.377289           0.4122
1            1     85           42  ...  0.4941  0.499930           0.4122

[2 rows x 7 columns]

   Edad > 68.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    219           56  ...  0.2557  0.380635           0.4126
1            1     80           40  ...  0.5000  0.500000           0.4126

[2 rows x 7 columns]

   Edad > 69.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    222           58  ...  0.2613  0.386045           0.4154
1            1     77           38  ...  0.4935  0.499916           0.4154

[2 rows x 7 columns]

   Edad > 71.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    247           65  ...  0.2632  0.387852           0.4041
1            1     52           31  ...  0.5962  0.481491           0.4041

[2 rows x 7 columns]

   Edad > 72.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    254           70  ...  0.2756  0.399289           0.4126
1            1     45           26  ...  0.5778  0.487894           0.4126

[2 rows x 7 columns]

   Edad > 74.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    258           71  ...  0.2752  0.398930           0.4095
1            1     41           25  ...  0.6098  0.475888           0.4095

[2 rows x 7 columns]

   Edad > 76.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    269           77  ...  0.2862  0.408579           0.4142
1            1     30           19  ...  0.6333  0.464462           0.4142

[2 rows x 7 columns]

   Edad > 77.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    271           78  ...  0.2878  0.409942           0.4146
1            1     28           18  ...  0.6429  0.459159           0.4146

[2 rows x 7 columns]

   Edad > 78.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    273           78  ...  0.2857  0.408151           0.4097
1            1     26           18  ...  0.6923  0.426041           0.4097

[2 rows x 7 columns]

   Edad > 79.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    274           78  ...  0.2847  0.407292           0.4069
1            1     25           18  ...  0.7200  0.403200           0.4069

[2 rows x 7 columns]

   Edad > 80.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    281           83  ...  0.2954  0.416278           0.4154
1            1     18           13  ...  0.7222  0.401254           0.4154

[2 rows x 7 columns]

   Edad > 81.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    282           83  ...  0.2943  0.415375           0.4122
1            1     17           13  ...  0.7647  0.359868           0.4122

[2 rows x 7 columns]

   Edad > 83.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    285           86  ...  0.3018  0.421434           0.4208
1            1     14           10  ...  0.7143  0.408151           0.4208

[2 rows x 7 columns]

   Edad > 85.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    291           89  ...  0.3058  0.424573           0.4191
1            1      8            7  ...  0.8750  0.218750           0.4191

[2 rows x 7 columns]

   Edad > 86.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    292           90  ...  0.3082  0.426426           0.4222
1            1      7            6  ...  0.8571  0.244959           0.4222

[2 rows x 7 columns]

   Edad > 88.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    293           91  ...  0.3106  0.428255           0.4252
1            1      6            5  ...  0.8333  0.277822           0.4252

[2 rows x 7 columns]

   Edad > 92.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    296           93  ...  0.3142  0.430957           0.4266
1            1      3            3  ...  1.0000  0.000000           0.4266

[2 rows x 7 columns]

   Edad > 94.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    297           94  ...  0.3165  0.432656           0.4298
1            1      2            2  ...  1.0000  0.000000           0.4298

[2 rows x 7 columns]

In [82]:
particiones_continuas(df_resumen, 'Fallece', 'Serum')

   Serum > 0.55  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0      1            0  ...  0.0000  0.000000           0.4352
1             1    298           96  ...  0.3221  0.436703           0.4352

[2 rows x 7 columns]

   Serum > 0.6499999999999999  Total  ...      Gini  Gini Media Pond
0                           0      5  ...  0.480000           0.4357
1                           1    294  ...  0.434984           0.4357

[2 rows x 7 columns]

   Serum > 0.725  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0     24            3  ...  0.1250  0.218750           0.4293
1              1    275           93  ...  0.3382  0.447642           0.4293

[2 rows x 7 columns]

   Serum > 0.775  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0     25            3  ...  0.1200  0.211200           0.4286
1              1    274           93  ...  0.3394  0.448415           0.4286

[2 rows x 7 columns]

   Serum > 0.8500000000000001  Total  ...      Gini  Gini Media Pond
0                           0     49  ...  0.149883           0.4135
1                           1    250  ...  0.465152           0.4135

[2 rows x 7 columns]

   Serum > 0.95  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0     81            9  ...  0.1111  0.197514           0.4032
1             1    218           87  ...  0.3991  0.479638           0.4032

[2 rows x 7 columns]

   Serum > 1.05  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    131           24  ...  0.1832  0.299276           0.4063
1             1    168           72  ...  0.4286  0.489804           0.4063

[2 rows x 7 columns]

   Serum > 1.1400000000000001  Total  ...      Gini  Gini Media Pond
0                           0    163  ...  0.322987           0.4023
1                           1    136  ...  0.497292           0.4023

[2 rows x 7 columns]

   Serum > 1.19  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    174           33  ...  0.1897  0.307428           0.3879
1             1    125           63  ...  0.5040  0.499968           0.3879

[2 rows x 7 columns]

   Serum > 1.25  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    198           42  ...  0.2121  0.334227           0.3894
1             1    101           54  ...  0.5347  0.497592           0.3894

[2 rows x 7 columns]

   Serum > 1.35  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    218           49  ...  0.2248  0.348530           0.3861
1             1     81           47  ...  0.5802  0.487136           0.3861

[2 rows x 7 columns]

   Serum > 1.45  Total  Fallece = 1  ...    Mean     Gini  Gini Media Pond
0             0    227           51  ...  0.2247  0.34842           0.3774
1             1     72           45  ...  0.6250  0.46875           0.3774

[2 rows x 7 columns]

   Serum > 1.55  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    232           53  ...  0.2284  0.352467           0.3765
1             1     67           43  ...  0.6418  0.459786           0.3765

[2 rows x 7 columns]

   Serum > 1.65  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    238           56  ...  0.2353  0.359868           0.3786
1             1     61           40  ...  0.6557  0.451515           0.3786

[2 rows x 7 columns]

   Serum > 1.75  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    247           60  ...  0.2429  0.367799           0.3779
1             1     52           36  ...  0.6923  0.426041           0.3779

[2 rows x 7 columns]

   Serum > 1.815  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0    251           61  ...  0.2430  0.367902           0.3722
1              1     48           35  ...  0.7292  0.394935           0.3722

[2 rows x 7 columns]

   Serum > 1.865  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0    259           69  ...  0.2664  0.390862           0.3973
1              1     40           27  ...  0.6750  0.438750           0.3973

[2 rows x 7 columns]

   Serum > 1.95  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    264           74  ...  0.2803  0.403464           0.4109
1             1     35           22  ...  0.6286  0.466924           0.4109

[2 rows x 7 columns]

   Serum > 2.05  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    265           75  ...  0.2830  0.405822           0.4134
1             1     34           21  ...  0.6176  0.472340           0.4134

[2 rows x 7 columns]

   Serum > 2.1500000000000004  Total  ...      Gini  Gini Media Pond
0                           0    270  ...  0.410874           0.4167
1                           1     29  ...  0.470863           0.4167

[2 rows x 7 columns]

   Serum > 2.25  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    271           79  ...  0.2915  0.413056            0.419
1             1     28           17  ...  0.6071  0.477059            0.419

[2 rows x 7 columns]

   Serum > 2.3499999999999996  Total  ...      Gini  Gini Media Pond
0                           0    274  ...  0.413472           0.4174
1                           1     25  ...  0.460800           0.4174

[2 rows x 7 columns]

   Serum > 2.45  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    276           81  ...  0.2935  0.414716           0.4177
1             1     23           15  ...  0.6522  0.453670           0.4177

[2 rows x 7 columns]

   Serum > 2.6  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    279           84  ...  0.3011  0.420878           0.4248
1            1     20           12  ...  0.6000  0.480000           0.4248

[2 rows x 7 columns]

   Serum > 2.8  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    282           85  ...  0.3014  0.421116           0.4231
1            1     17           11  ...  0.6471  0.456723           0.4231

[2 rows x 7 columns]

   Serum > 2.95  Total  Fallece = 1  ...    Mean     Gini  Gini Media Pond
0             0    283           86  ...  0.3039  0.42309           0.4255
1             1     16           10  ...  0.6250  0.46875           0.4255

[2 rows x 7 columns]

   Serum > 3.1  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    285           88  ...  0.3088  0.426885           0.4298
1            1     14            8  ...  0.5714  0.489804           0.4298

[2 rows x 7 columns]

   Serum > 3.3  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    286           88  ...  0.3077  0.426041           0.4281
1            1     13            8  ...  0.6154  0.473366           0.4281

[2 rows x 7 columns]

   Serum > 3.45  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    287           88  ...  0.3066  0.425193            0.426
1             1     12            8  ...  0.6667  0.444422            0.426

[2 rows x 7 columns]

   Serum > 3.6  Total  Fallece = 1  ...   Mean      Gini  Gini Media Pond
0            0    289           89  ...  0.308  0.426272           0.4261
1            1     10            7  ...  0.700  0.420000           0.4261

[2 rows x 7 columns]

   Serum > 3.75  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0    290           90  ...  0.3103  0.428028           0.4285
1             1      9            6  ...  0.6667  0.444422           0.4285

[2 rows x 7 columns]

   Serum > 3.9  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    291           90  ...  0.3093  0.427267           0.4259
1            1      8            6  ...  0.7500  0.375000           0.4259

[2 rows x 7 columns]

   Serum > 4.2  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    292           91  ...  0.3116  0.429011           0.4285
1            1      7            5  ...  0.7143  0.408151           0.4285

[2 rows x 7 columns]

   Serum > 4.7  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    293           92  ...  0.3140  0.430808           0.4311
1            1      6            4  ...  0.6667  0.444422           0.4311

[2 rows x 7 columns]

   Serum > 5.4  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    294           92  ...  0.3129  0.429987           0.4281
1            1      5            4  ...  0.8000  0.320000           0.4281

[2 rows x 7 columns]

   Serum > 5.949999999999999  Total  ...      Gini  Gini Media Pond
0                          0    295  ...  0.431772            0.431
1                          1      4  ...  0.375000            0.431

[2 rows x 7 columns]

   Serum > 6.449999999999999  Total  ...      Gini  Gini Media Pond
0                          0    296  ...  0.430957           0.4266
1                          1      3  ...  0.000000           0.4266

[2 rows x 7 columns]

   Serum > 7.9  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    297           94  ...  0.3165  0.432656           0.4298
1            1      2            2  ...  1.0000  0.000000           0.4298

[2 rows x 7 columns]

   Serum > 9.2  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    298           95  ...  0.3188  0.434333           0.4329
1            1      1            1  ...  1.0000  0.000000           0.4329

[2 rows x 7 columns]

### 030103 Impureza de Gini
Calculamos la impureza de Gini de cada una de las particiones.

In [83]:
# Generemos una función que añade la columna Gini
def gini(df_i):
  df_i['Gini'] = 1 - df_i['Mean']**2 - (1-df_i['Mean'])**2
  df_i['Gini Media Pond'] = np.round(
      (df_i['Gini'][0]*df_i['Total'][0] + 
       df_i['Gini'][1]*df_i['Total'][1])/
       (df_i['Total'][0]+df_i['Total'][1]),
       4)
  return df_i

In [84]:
gini(df_i)

   Edad > 94.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    297           94  ...  0.3165  0.432656           0.4298
1            1      2            2  ...  1.0000  0.000000           0.4298

[2 rows x 7 columns]

#### EJERCICIO
Modifica la función particion_categorica para incorporar el Gini como medida de impureza al resultado.

In [85]:
def particion_categorica(df, target, var_discreta):
  """
  Genera un dataframe con información sobre la partición utilizando la variable
  discreta binaria aportada, incluyendo la medida de impureza con Gini.
  """
  df_i = df.groupby(var_discreta)[target].agg(['count', 'sum']).reset_index()
  df_i.columns = [var_discreta, 'Total', target + ' = 1']
  df_i[target + ' = 0'] = df_i['Total'] - df_i[target + ' = 1']
  df_i['Mean'] = np.round(df_i[target + ' = 1']/df_i['Total'], 4)
  return gini(df_i)

In [89]:
df_i = particion_categorica(df_resumen, 'Fallece', 'Anemia')
df_i

   Anemia  Total  Fallece = 1  Fallece = 0    Mean      Gini  Gini Media Pond
0       0    170           50          120  0.2941  0.415210            0.434
1       1    129           46           83  0.3566  0.458873            0.434

#### EJERCICIO
Crea la función mejor_particion_continua que devuelve el árbol con la partición óptima (según el Gini) para una variable continua.

In [112]:
def mejor_particion_continua(df, target, var_continua):
  """
  Muestra una serie dataframes con información sobre las distintas particiones 
  posibles utilizando la variable continua aportada.
  """
  valores_edad_unicos_ordenados = df[var_continua].sort_values().unique()
  valores_particiones = (valores_edad_unicos_ordenados[:-1] + 
                         valores_edad_unicos_ordenados[1:])/2
  particion_optima = []

  for i, valor in enumerate(valores_particiones):
    df_i = df.copy(deep=True)
    filtro_i = df_i[var_continua] > valor
    df_i[str(var_continua) + ' > ' + str(valor)] = filtro_i.astype(int)
    df_i = particion_categorica(df_i, 
                                'Fallece', 
                                str(var_continua) + ' > ' + str(valor))

    if i == 0:
      particion_optima = df_i
    else:
      if df_i['Gini Media Pond'][0] < particion_optima['Gini Media Pond'][0]:
        particion_optima = df_i
    
  return particion_optima

In [113]:
mejor_particion_continua(df_resumen, 'Fallece', 'Edad')

   Edad > 71.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    247           65  ...  0.2632  0.387852           0.4041
1            1     52           31  ...  0.5962  0.481491           0.4041

[2 rows x 7 columns]

In [114]:
mejor_particion_continua(df_resumen, 'Fallece', 'Serum')

   Serum > 1.815  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0    251           61  ...  0.2430  0.367902           0.3722
1              1     48           35  ...  0.7292  0.394935           0.3722

[2 rows x 7 columns]

### 030104 Cuál es la mejor partición?

In [115]:
particion_categorica(df_resumen, 'Fallece', 'Anemia')

   Anemia  Total  Fallece = 1  Fallece = 0    Mean      Gini  Gini Media Pond
0       0    170           50          120  0.2941  0.415210            0.434
1       1    129           46           83  0.3566  0.458873            0.434

In [116]:
mejor_particion_continua(df_resumen, 'Fallece', 'Edad')

   Edad > 71.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    247           65  ...  0.2632  0.387852           0.4041
1            1     52           31  ...  0.5962  0.481491           0.4041

[2 rows x 7 columns]

In [117]:
mejor_particion_continua(df_resumen, 'Fallece', 'Serum')

   Serum > 1.815  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0    251           61  ...  0.2430  0.367902           0.3722
1              1     48           35  ...  0.7292  0.394935           0.3722

[2 rows x 7 columns]

#### EJEMPLO
Función que devuelve la mejor partición dados un dataframe, una lista de variables continuas y otra de variables discretas variables

In [118]:
def seleccion_particion(df, target, lista_vars_continuas, lista_vars_binarias):
  particion_optima = []

  for i, var in enumerate(lista_vars_continuas+lista_vars_binarias):
    if var in lista_vars_continuas:
      df_i = mejor_particion_continua(df, target, var)
    if var in lista_vars_binarias:
      df_i = particion_categorica(df,  target, var)
    

    if i == 0:
      particion_optima = df_i
    else:
      if df_i['Gini Media Pond'][0] < particion_optima['Gini Media Pond'][0]:
        particion_optima = df_i
    
  return particion_optima

In [120]:
seleccion_particion(df_resumen, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Serum > 1.815  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0    251           61  ...  0.2430  0.367902           0.3722
1              1     48           35  ...  0.7292  0.394935           0.3722

[2 rows x 7 columns]

## 0302 Construímos las ramas
Vamos a contruír el resto del árbol sin repetir variables.

In [121]:
# Realizamos la partición
df_resumen_1 = df_resumen[df_resumen['Serum']>1.815]
df_resumen_2 = df_resumen[df_resumen['Serum']<1.815]

### 030201 Rama Izquierda (1)

In [124]:
# Siguiente partición
seleccion_particion(df_resumen_1, 'Fallece', ['Edad'], ['Anemia'])

   Edad > 71.0  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0     31           20  ...  0.6452  0.457834           0.3692
1            1     17           15  ...  0.8824  0.207540           0.3692

[2 rows x 7 columns]

In [132]:
# Realizamos la siguiente partición
df_resumen_1_1 = df_resumen[((df_resumen['Serum']>1.815)&(df_resumen['Edad']>71))]
df_resumen_1_2 = df_resumen[((df_resumen['Serum']>1.815)&(df_resumen['Edad']<71))]

In [133]:
# Siguiente partición
seleccion_particion(df_resumen_1_1, 'Fallece', [], ['Anemia'])

   Anemia  Total  Fallece = 1  Fallece = 0    Mean      Gini  Gini Media Pond
0       0     10            9            1  0.9000  0.180000           0.2067
1       1      7            6            1  0.8571  0.244959           0.2067

In [134]:
# Siguiente partición
seleccion_particion(df_resumen_1_2, 'Fallece', [], ['Anemia'])

   Anemia  Total  Fallece = 1  Fallece = 0    Mean     Gini  Gini Media Pond
0       0     20           13            7  0.6500  0.45500           0.4578
1       1     11            7            4  0.6364  0.46279           0.4578

### 030202 Rama derecha (2)

In [136]:
# Siguiente partición
seleccion_particion(df_resumen_2, 'Fallece', ['Edad'], ['Anemia'])

   Edad > 79.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    236           51  ...  0.2161  0.338802           0.3451
1            1     15           10  ...  0.6667  0.444422           0.3451

[2 rows x 7 columns]

In [137]:
# Realizamos la siguiente partición
df_resumen_2_1 = df_resumen[((df_resumen['Serum']<1.815)&(df_resumen['Edad']>79.5))]
df_resumen_2_2 = df_resumen[((df_resumen['Serum']<1.815)&(df_resumen['Edad']<79.5))]

In [138]:
# Siguiente partición
seleccion_particion(df_resumen_2_1, 'Fallece', [], ['Anemia'])

   Anemia  Total  Fallece = 1  Fallece = 0    Mean      Gini  Gini Media Pond
0       0      8            5            3  0.6250  0.468750           0.4405
1       1      7            5            2  0.7143  0.408151           0.4405

In [139]:
# Siguiente partición
seleccion_particion(df_resumen_2_2, 'Fallece', [], ['Anemia'])

   Anemia  Total  Fallece = 1  Fallece = 0    Mean      Gini  Gini Media Pond
0       0    132           23          109  0.1742  0.287709           0.3343
1       1    104           28           76  0.2692  0.393463           0.3343

### EJERCICIO
Genera un árbol sin restringir la repetición de variables en una misma rama.

In [148]:
seleccion_particion(df_resumen, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Serum > 1.815  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0              0    251           61  ...  0.2430  0.367902           0.3722
1              1     48           35  ...  0.7292  0.394935           0.3722

[2 rows x 7 columns]

In [149]:
df_resumen_1 = df_resumen[(df_resumen['Serum']>1.815)]
df_resumen_2 = df_resumen[(df_resumen['Serum']<1.815)]

In [150]:
seleccion_particion(df_resumen_1, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Serum > 2.05  Total  Fallece = 1  ...    Mean     Gini  Gini Media Pond
0             0     14           14  ...  1.0000  0.00000           0.3346
1             1     34           21  ...  0.6176  0.47234           0.3346

[2 rows x 7 columns]

In [151]:
df_resumen_1_1 = df_resumen[((df_resumen['Serum']>1.815)&(df_resumen['Serum']>2.05))]
df_resumen_1_2 = df_resumen[((df_resumen['Serum']>1.815)&(df_resumen['Serum']<2.05))]

In [152]:
seleccion_particion(df_resumen_1_1, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Serum > 6.449999999999999  Total  ...      Gini  Gini Media Pond
0                          0     31  ...  0.487007            0.444
1                          1      3  ...  0.000000            0.444

[2 rows x 7 columns]

In [153]:
seleccion_particion(df_resumen_1_2, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Edad > 49.0  Total  Fallece = 1  Fallece = 0  Mean  Gini  Gini Media Pond
0            0      1            1            0   1.0   0.0              0.0
1            1     13           13            0   1.0   0.0              0.0

In [154]:
seleccion_particion(df_resumen_2, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Edad > 79.5  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0            0    236           51  ...  0.2161  0.338802           0.3451
1            1     15           10  ...  0.6667  0.444422           0.3451

[2 rows x 7 columns]

In [155]:
df_resumen_2_1 = df_resumen[((df_resumen['Serum']<1.815)&(df_resumen['Edad']>79.5))]
df_resumen_2_2 = df_resumen[((df_resumen['Serum']<1.815)&(df_resumen['Edad']<79.5))]

In [156]:
seleccion_particion(df_resumen_2_1, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Serum > 0.95  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0      3            1  ...  0.3333  0.444422           0.3889
1             1     12            9  ...  0.7500  0.375000           0.3889

[2 rows x 7 columns]

In [157]:
seleccion_particion(df_resumen_2_2, 'Fallece', ['Edad', 'Serum'], ['Anemia'])

   Serum > 0.95  Total  Fallece = 1  ...    Mean      Gini  Gini Media Pond
0             0     78            8  ...  0.1026  0.184146           0.3261
1             1    158           43  ...  0.2722  0.396214           0.3261

[2 rows x 7 columns]

# 04 Construcción árbol de decisión
Ahora de manera automática, utilizando la librería scikitlearn.

In [168]:
# Nos importamos las funciones de árboles de scikit learn
from sklearn import tree

In [169]:
# Inicializamos un árbol. Por ahora está vacío. Solo definimos cómo queremos que sea.
arbol = tree.DecisionTreeClassifier(max_depth=3)

In [171]:
# Definimos el árbol inicializado a partir de los datos que le pasemos con .fit()
arbol = arbol.fit(X = df_resumen[['Edad', 'Serum', 'Anemia']], 
                  y = df_resumen[['Fallece']])
arbol

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=3, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [174]:
# Podemos visualizar la estructura
esquema_print = tree.export_text(arbol, feature_names=['Edad', 'Serum', 'Anemia'])
print(esquema_print)

|--- Serum <= 1.81
|   |--- Edad <= 79.50
|   |   |--- Serum <= 0.95
|   |   |   |--- class: 0
|   |   |--- Serum >  0.95
|   |   |   |--- class: 0
|   |--- Edad >  79.50
|   |   |--- Serum <= 0.95
|   |   |   |--- class: 0
|   |   |--- Serum >  0.95
|   |   |   |--- class: 1
|--- Serum >  1.81
|   |--- Serum <= 2.05
|   |   |--- class: 1
|   |--- Serum >  2.05
|   |   |--- Serum <= 6.45
|   |   |   |--- class: 1
|   |   |--- Serum >  6.45
|   |   |   |--- class: 1

In [178]:
import graphviz 
dot_data = tree.export_graphviz(arbol, 
                                out_file=None, 
                                feature_names=['Edad', 'Serum', 'Anemia']) 
graph = graphviz.Source(dot_data) 
graph